/*//////////////////////////////////////////////////////////////  
Частота считывается с кварцевых резонаторов.
Разность значений - необходимая величина для продолжения измерений   
//////////////////////////////////////////////////////////////*/

#include "Frequency.h"
#include <iostream> // for std::cout

float Glycemia::Calculate()
{
    std::cout << "Введите разность частот: " << std::endl;
    std::cin >> z; //считывание введенных значений
    if ((z>4.0f)||(z<-4.0f)) //диапазоне от 32.000 до 36.000 кГц
    {
      std::cout << "Разность частот не соответствует заданному диапазону" << std::endl;
      z=0;
    }
};